[
  {
    "bookId": 1,
    "bookName": "The Dating Playbook for Men",
    "author": "Andrew Ferebee",
    "image": "https://i.ibb.co/fpPfvXr/book1.png",
    "review": "In \"The Dating Playbook for Men,\" Andrew Ferebee delivers a comprehensive guide for men seeking to navigate the complexities of modern dating. Through a blend of personal anecdotes, practical advice, and psychological insights, Ferebee tackles the intricacies of attraction, communication, and self-improvement. From overcoming approach anxiety to mastering the art of conversation, this book provides actionable strategies for building confidence and developing authentic connections with women. Ferebee's emphasis on self-awareness and continuous growth sets this book apart, offering readers not just a playbook for dating success, but a roadmap for personal development. Whether you're a novice or a seasoned dater, \"The Dating Playbook for Men\" equips you with the tools and mindset needed to thrive in the world of relationships.",
    "totalPages": 250,
    "rating": 4.5,
    "category": "Self-help",
    "tags": ["Relationships", "Self-improvement"],
    "publisher": "CreateSpace Independent Publishing Platform",
    "yearOfPublishing": 2015
  },
  {
    "bookId": 2,
    "bookName": "Why Do You Hate Money?",
    "author": "Barry L. Martin",
    "image": "https://i.ibb.co/vXQ7LG3/book2.png",
    "review": "In \"Why Do You Hate Money?\" Barry L. Martin delves deep into the psychological underpinnings of our relationship with money. Through engaging anecdotes and insightful analysis, Martin explores the various ways in which our attitudes, beliefs, and emotions shape our financial decisions. From unconscious biases to societal influences, this book sheds light on the often irrational behaviors that sabotage our financial well-being. Martin challenges readers to confront their money mindset and offers practical strategies for cultivating a healthier and more empowered relationship with money. Whether you're struggling with debt, seeking to build wealth, or simply curious about the psychology of money, \"Why Do You Hate Money?\" provides a thought-provoking journey into the heart of our financial psyche.",
    "totalPages": 180,
    "rating": 4.2,
    "category": "Finance",
    "tags": ["Personal Finance", "Psychology"],
    "publisher": "Wiley",
    "yearOfPublishing": 2020
  },
  {
    "bookId": 3,
    "bookName": "The Hate U Give",
    "author": "Angie Thomas",
    "image": "https://i.ibb.co/0BZXLWm/book3.png",
    "review": "\"The Hate U Give\" by Angie Thomas is a gripping and timely novel that confronts the complexities of race, identity, and justice in contemporary America. Through the eyes of sixteen-year-old Starr Carter, Thomas navigates the aftermath of a police shooting that shakes her community to its core. As Starr grapples with grief, anger, and fear, she finds herself at the center of a national debate about race relations and police violence. With raw honesty and unflinching courage, Thomas tackles difficult topics with sensitivity and nuance, offering readers a poignant glimpse into the lived experiences of marginalized communities. \"The Hate U Give\" is not just a compelling work of fiction; it's a powerful call to action against systemic injustice and a testament to the resilience of the human spirit.",
    "totalPages": 464,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Social Issues", "Young Adult"],
    "publisher": "Balzer + Bray",
    "yearOfPublishing": 2017
  },
  {
    "bookId": 4,
    "bookName": "The Scholarship Monthly Planner",
    "author": "Scholarship Advisor",
    "image": "https://i.ibb.co/k5M9HLf/book4.png",
    "review": "\"The Scholarship Monthly Planner\" is an invaluable resource for students embarking on the journey of scholarship applications. Created by Scholarship Advisor, this planner offers a systematic approach to organizing deadlines, tracking progress, and maximizing opportunities for financial aid. With user-friendly layouts and helpful tips, it empowers students to stay focused and proactive in their scholarship pursuits. From essay prompts to recommendation letters, this planner covers all aspects of the application process, providing guidance every step of the way. Whether you're a high school senior or a college student seeking funding for graduate studies, \"The Scholarship Monthly Planner\" is a must-have tool for achieving your academic and financial goals.",
    "totalPages": 100,
    "rating": 4.1,
    "category": "Education",
    "tags": ["Planner", "College Prep"],
    "publisher": "Self-Published",
    "yearOfPublishing": 2021
  },
  {
    "bookId": 5,
    "bookName": "Annotated Texas Family Code 2019",
    "author": "Legislative Council",
    "image": "https://i.ibb.co/4stLtqB/book5.png",
    "review": "\"Annotated Texas Family Code 2019\" is the definitive reference for legal practitioners navigating the complexities of Texas family law. Compiled by the Legislative Council, this comprehensive guide offers a thorough analysis of the Texas Family Code, complete with annotations, case law references, and expert commentary. From divorce proceedings to child custody disputes, it provides practitioners with the knowledge and insights needed to navigate the intricacies of family law practice. Whether you're a seasoned attorney or a law student preparing for the bar exam, this annotated code serves as an indispensable resource for understanding and interpreting Texas family law statutes.",
    "totalPages": 800,
    "rating": 4.6,
    "category": "Law",
    "tags": ["Legal", "Family Law"],
    "publisher": "Thomson Reuters",
    "yearOfPublishing": 2019
  },
  {
    "bookId": 6,
    "bookName": "Loving Jesus More",
    "author": "Philip Graham Ryken",
    "image": "https://i.ibb.co/VCfSCrq/book6.png",
    "review": "In \"Loving Jesus More,\" Philip Graham Ryken invites readers on a transformative journey of faith and devotion. Through heartfelt reflections and profound insights, Ryken explores what it means to deepen one's relationship with Jesus Christ. Drawing upon scripture, theology, and personal experience, he challenges readers to reexamine their priorities, surrender their hearts, and pursue a deeper intimacy with the Savior. From the joys of worship to the trials of discipleship, Ryken offers practical guidance for cultivating a vibrant and authentic faith that glorifies God and transforms lives. \"Loving Jesus More\" is more than a book; it's a spiritual companion for those seeking to draw nearer to the heart of God and experience the fullness of His love.",
    "totalPages": 150,
    "rating": 4.8,
    "category": "Religion",
    "tags": ["Faith", "Spirituality"],
    "publisher": "Crossway",
    "yearOfPublishing": 2004
  }
]
